app/controllers/items_controller.rb

SELECT * FROM "items" WHERE ("items"."id" = 6)
---
  def show
    @item = Item.find(params[:id])

INSERT INTO "items" ("room_id", "manufacturer_id", "created_at", "updated_at", "barcode", "model_name_id") VALUES(1, 2, '2009-01-10 17:20:11', '2009-01-10 17:20:11', 963, 2)
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save

SELECT * FROM "model_names" WHERE ("model_names"."manufacturer_id" = '2')
---
  def get_models_for_manufacturer
    @model_names = ModelName.find_all_by_manufacturer_id(params["manufacturer_id"])